// task 1 --------------------
// Отправьте GET запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 1. Если все сделано верно,
// сервер пришлет строку hello. Не забывайте указывать параметр auth (ключ в чате). Используем POSTMAN.
//

// task 2 --------------------
// Отправьте GET запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 2. Добавьте параметр name с вашим именем
// на латинице. Если все сделано верно, сервер пришлет строку hello ваше имя. Не забывайте указывать параметр auth (ключ в чате).
// Используем POSTMAN.


// task 3 --------------------
// Отправьте GET запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 3. Добавьте параметр num1 и num2 содержащие числа.
// Если все сделано верно, сервер вернет сумму чисел. Не забывайте указывать параметр auth (ключ в чате). Используем POSTMAN.
//


// task 4 --------------------
// Отправьте GET запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 4. Добавьте параметр num1 и num2 содержащие числа.
// Если все сделано верно, сервер вернет случайное число в заданном диапазоне. Не забывайте указывать параметр auth (ключ в чате).
// Используем POSTMAN.


// task 5 --------------------
// Отправьте GET запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 5. Если все сделано верно, сервер вернет
// текущее время и дату. Не забывайте указывать параметр auth (ключ в чате). Используем POSTMAN.


// task 6 --------------------
// Отправьте GET запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 6. Добавьте параметр num1 и num2 содержащие числа.
// Если все сделано верно, сервер вернет большее число. Не забывайте указывать параметр auth (ключ в чате). Используем POSTMAN.


// task 7 --------------------
// Отправьте GET запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 7. Если все сделано верно,
// сервер случайную ссылку на изображение. Не забывайте указывать параметр auth (ключ в чате). Используем POSTMAN.


// task 8 --------------------
// Отправьте GET запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 8. В качестве параметра по очереди укажите year
//  равный году вашего рождения. Если все правильно сервер вернет ваш возраст. Не забывайте указывать параметр auth (ключ в чате).
//  Используем POSTMAN.


// task 9 --------------------
// Отправьте GET запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 9. В качестве параметра
// по очереди укажите m = 1, d=1, y=1. Если все сделано верно, сервер возвратит дату или месяц или год. Не забывайте указывать
// параметр auth (ключ в чате). Используем POSTMAN.


// task 10 --------------------
// Отправьте POST запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 1. Если все сделано верно,
// сервер пришлет строку hello. Не забывайте указывать параметр auth (ключ в чате). Используем POSTMAN.


// task 11 --------------------
// Отправьте POST запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 2. Добавьте параметр name с вашим именем на латинице.
//  Если все сделано верно, сервер пришлет строку hello ваше имя. Не забывайте указывать параметр auth (ключ в чате). Используем POSTMAN.


// task 12 --------------------
// Отправьте POST запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 3. Добавьте параметр num1 и num2 содержащие числа.
// Если все сделано верно, сервер вернет сумму чисел. Не забывайте указывать параметр auth (ключ в чате). Используем POSTMAN.


// task 13 --------------------
// Отправьте POST запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 4. Добавьте параметр num1 и num2 содержащие числа.
// Если все сделано верно, сервер вернет случайное число в заданном диапазоне. Не забывайте указывать параметр auth (ключ в чате). Используем POSTMAN.


// task 14 --------------------
// Отправьте POST запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 5. Если все сделано верно, сервер вернет текущее
// время и дату. Не забывайте указывать параметр auth (ключ в чате). Используем POSTMAN.


// task 15 --------------------
// Отправьте POST запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 6. Добавьте параметр num1 и num2 содержащие числа.
// Если все сделано верно, сервер вернет большее число. Не забывайте указывать параметр auth (ключ в чате). Используем POSTMAN.



// task 16 --------------------
// Отправьте POST запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 7. Если все сделано верно, сервер случайную
// ссылку на изображение. Не забывайте указывать параметр auth (ключ в чате). Используем POSTMAN.


// task 17 --------------------
// Отправьте POST запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 8. В качестве параметра по очереди укажите year
// равный году вашего рождения. Если все правильно сервер вернет ваш возраст. Не забывайте указывать параметр auth (ключ в чате).
// Используем POSTMAN.


// task 18 --------------------
// Отправьте POST запрос на сайт http://getpost.itgid.info/index2.php. В качестве action укажите 9. В качестве параметра по очереди
// укажите m = 1, d=1, y=1. Если все сделано верно, сервер возвратит дату или месяц или год. Не забывайте указывать параметр auth (ключ в чате).
// Используем POSTMAN. 


